# PANDAS

## pandas-mask

In [15]:
# df.where:和df。mask相反，取False处进行数值变化
# DataFrame.mask(self, cond, other=nan, inplace=False, axis=None, level=None, errors='raise', try_cast=False)
# DataFrame.where(self, cond, other=nan, inplace=False, axis=None, level=None, errors='raise', try_cast=False)
import pandas as pd
data = pd.read_csv(r"C:\Users\33120\Desktop\test.csv", index_col=0, parse_dates=True)
data['mark'] = '1'
data['mark'].mask(data['tem_mean'].isnull(), '9.1', inplace = True)
data

             tem_mean mark
date
2015-01-01  13.470833    1
2015-01-02  13.037083    1
2015-01-03        NaN  9.1
2015-01-04        NaN  9.1
2015-01-05        NaN  9.1
...               ...  ...
2015-03-07  10.805417    1
2015-03-08  10.743750    1
2015-03-09  10.930417    1
2015-03-10  10.997917    1
2015-03-11  10.732083    1

[70 rows x 2 columns]

## pandas-astype-(errors='ignore')

In [18]:
# data['tem_mean'].astype('int')    #Cannot convert non-finite values (NA or inf) to integer
# data.astype(dtype, copy: bool = True, errors: str = 'raise')
data['tem_mean'].astype('int', errors='ignore')    #忽略无法转化数据类型的部分

date
2015-01-01    13.470833
2015-01-02    13.037083
2015-01-03          NaN
2015-01-04          NaN
2015-01-05          NaN
                ...
2015-03-07    10.805417
2015-03-08    10.743750
2015-03-09    10.930417
2015-03-10    10.997917
2015-03-11    10.732083
Name: tem_mean, Length: 70, dtype: float64

## pandas-insert

In [32]:
# data.insert(loc, column, value, allow_duplicates=False)
data.insert(0,'yyq',2,allow_duplicates=True)
data.insert(0,'yyq',2,allow_duplicates=True)
data

            yyq  yyq  yyq  yyq  yyq   tem_mean mark
date
2015-01-01    2    2    2    2    2  13.470833    1
2015-01-02    2    2    2    2    2  13.037083    1
2015-01-03    2    2    2    2    2        NaN  9.1
2015-01-04    2    2    2    2    2        NaN  9.1
2015-01-05    2    2    2    2    2        NaN  9.1
...         ...  ...  ...  ...  ...        ...  ...
2015-03-07    2    2    2    2    2  10.805417    1
2015-03-08    2    2    2    2    2  10.743750    1
2015-03-09    2    2    2    2    2  10.930417    1
2015-03-10    2    2    2    2    2  10.997917    1
2015-03-11    2    2    2    2    2  10.732083    1

[70 rows x 7 columns]

## pandas-sort_values()

In [33]:
data['tem_mean'].sort_values(ascending=False)

date
2015-01-01    13.470833
2015-01-08    13.094167
2015-01-02    13.037083
2015-01-09    12.984000
2015-01-12    12.899583
                ...
2015-01-03          NaN
2015-01-04          NaN
2015-01-05          NaN
2015-01-06          NaN
2015-01-07          NaN
Name: tem_mean, Length: 70, dtype: float64

## pandas-apply+lambda

In [39]:
d = {"col1" : ["96%(1368608/1412722)",
"97%(1389916/1427922)",
"97%(1338695/1373803)",
"96%(1691941/1745196)",
"95%(1878802/1971608)",
"97%(944218/968845)",
"96%(1294939/1336576)"]}
df1 = pd.DataFrame(d)
df1['正确数'] = df1.iloc[:,0].apply(lambda x : x[x.index('(') + 1 : x.index('/')])

                   col1      正确数
0  96%(1368608/1412722)  1368608
1  97%(1389916/1427922)  1389916
2  97%(1338695/1373803)  1338695
3  96%(1691941/1745196)  1691941
4  95%(1878802/1971608)  1878802
5    97%(944218/968845)   944218
6  96%(1294939/1336576)  1294939

In [49]:
data['ax1'] = data.apply(lambda x:x.iloc[1]*x['tem_mean'], axis=1)  #以dataframa中各行为对象
data['ax2'] = data['tem_mean'].apply(lambda x:x+1)  #以Series中的各元素为对象

## str-split-lxq

In [ ]:
def get_doubt(x):
    mark_list = x.split('/')  #按'/'划分字符串，返回列表
    for i in range(len(mark_list)):  #取出mark_list中的各元素的前两个字符进行判断
        mark_list[i] = mark_list[i][:2]  
    if ('4.' not in mark_list)&('3.' in mark_list):  #新mark_list中包含'3.'且不包含'4.'则返回True，否则返回False；
        return True
    else:
        return False
    
doubt = marked[marked['mark']].apply(get_doubt)  #对Series: marked['mark']中的所有元素，进行判断，返回布尔数组，取出True对应DataFrame: marked的部分